{"class_name": "Model", "keras_version": "2.2.4-tf", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, 4], "name": "input", "sparse": false}, "inbound_nodes": [], "name": "input"}, {"class_name": "TimeDistributed", "config": {"dtype": "float32", "layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "dense", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 100, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "tdist_0"}, "inbound_nodes": [[["input", 0, 0, {}]]], "name": "tdist_0"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation"}, "inbound_nodes": [[["tdist_0", 0, 0, {}]]], "name": "activation"}, {"class_name": "TimeDistributed", "config": {"dtype": "float32", "layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 100, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "tdist_1"}, "inbound_nodes": [[["activation", 0, 0, {}]]], "name": "tdist_1"}, {"class_name": "Lambda", "config": {"function": ["YwIAAAACAAAABQAAAFNgAQBzNAAAAHQAAGoBAHQAAGoCAHQAAGoDAHwAAHwBAIMCAGQBAGQCAIMB\nAXQAAGoEAHwAAIMBAIMCAFMoAwAAAE50BAAAAGF4aXNp/////ygFAAAAdAEAAABLdAQAAABjYXN0\ndAMAAABhbnl0CQAAAG5vdF9lcXVhbHQFAAAAZHR5cGUoAgAAAHQBAAAAWHQIAAAAbWFza192YWwo\nAAAAACgAAAAAc4oAAAAvYWZzL2Nlcm4uY2gvd29yay9jL2NzYXVlci9hbmFseXNlcy9ib29zdGVk\nSmV0VGFnZ2Vycy9jb25zdGl0VG9wVGFnZ2VyRE5OL3ZlbnYvdmVudjJwNy9saWIvcHl0aG9uMi43\nL3NpdGUtcGFja2FnZXMvZW5lcmd5Zmxvdy9hcmNocy9lZm4ucHl0DQAAAHBmbl9tYXNrX2Z1bmNR\nAAAAcwIAAAAAAw==\n", [0.0], null], "name": "mask", "output_shape_module": null, "dtype": "float32", "trainable": true, "module": "energyflow.archs.efn", "function_type": "lambda", "output_shape_type": "raw", "output_shape": null, "arguments": {}}, "inbound_nodes": [[["input", 0, 0, {}]]], "name": "mask"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["tdist_1", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "Dot", "config": {"normalize": false, "dtype": "float32", "trainable": true, "axes": 0, "name": "sum"}, "inbound_nodes": [[["mask", 0, 0, {}], ["activation_1", 0, 0, {}]]], "name": "sum"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "dense_0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 50, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["sum", 0, 0, {}]]], "name": "dense_0"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["dense_0", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 25, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "activation_3"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 10, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "dense_2"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "activation_4"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "output", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "output"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "softmax", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["output", 0, 0, {}]]], "name": "activation_5"}], "input_layers": [["input", 0, 0]], "output_layers": [["activation_5", 0, 0]], "name": "model"}, "backend": "tensorflow"}